app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
    @posts = Post.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts"