app/controllers/posts_controller.rb

  def show
    @category = Category.find(params[:category_id])
    @category_title_name = @category.name.split("_").map {|word| word.capitalize}.join(" ")
    @post = Post.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]